## working with Pandas

In [2]:
import pandas as pd

In [ ]:
# Create a Series from a list
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
print(s[1:4])

1    20
2    30
3    40
dtype: int64

In [5]:
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [6]:
print(df['Name'])  # Access the 'Name' column

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [7]:
print(df.iloc[2])   # Access the third row by position
print(df.loc[1])    # Access the second row by label

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object
Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [8]:
print(df[['Name', 'Age']])  # Select specific columns
print(df[1:3])             # Select specific rows

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [10]:
unique_dates = df['Age'].unique()
print(unique_dates)

[25 30 35 28]

In [13]:
high_above_102 = df[df['Age'] > 25]
print(high_above_102)

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [14]:
df.to_csv('trading_data.csv', index=False)

In [18]:
df.to_excel('trading_data.xlsx', index=True)

In [19]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [20]:
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [21]:
x = df[['Department']]
x

        Department
0  Architect Group
1   Software Group
2      Design Team
3   Infrastructure

In [22]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

In [23]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [ ]:
z = {"Student":["David", "Samuel", "Terry", "Evan"], "Age":[27,24,22,32], "Country":["UK","Canada", "China", "USA"], "Course":["Python", "Data Structure", "Machine Learning", "Web Development"], "Marks": [85,72,89,76]}

df = pd.DataFrame(z)
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada    Data Structure     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [26]:
#write your code here
b = df[["Marks"]]
b

   Marks
0     85
1     72
2     89
3     76

In [27]:
c = df[["Country", "Course"]]
c

  Country            Course
0      UK            Python
1  Canada    Data Structure
2   China  Machine Learning
3     USA   Web Development

#### To view the column as a series, just use one bracket:

In [30]:
z = df["Country"]
z

0        UK
1    Canada
2     China
3       USA
Name: Country, dtype: object

In [31]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

### Exercise 2: <code>loc()</code> and <code>iloc()</code> functions

<code>loc()</code> is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

Simple syntax for your understanding: 

 - loc[row_label, column_label]

<code>iloc()</code> is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it.

Simple syntax for your understanding: 
   
 - iloc[row_index, column_index]

<h4 id="data">Let us see some examples on the same.</h4>

In [32]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'David'

In [33]:
# Access the value on the first row and the third column

df.iloc[0,2]

'UK'

In [35]:
# Access the column using the name

df.loc[0, 'Course']

'Python'

Let us create a new dataframe called 'df2' and assign 'df' to it. Now, let us set the "Name" column as an index column using the method set_index().

In [39]:
df2=df
df2=df2.set_index("Student")
df2

         Age Country            Course  Marks
Student
David     27      UK            Python     85
Samuel    24  Canada    Data Structure     72
Terry     22   China  Machine Learning     89
Evan      32     USA   Web Development     76

In [40]:
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada    Data Structure     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76